20210926143523-communication.org
:PROPERTIES:
:ID:       d68263db-a8c5-478e-b456-8a753eb34416
:END:
#+title: communication
* 概要
効果的なコミュニケーションのTipsをまとめる。
* Memo
* Tasks
* Reference
** DONE [[https://www.chiark.greenend.org.uk/~sgtatham/bugs-jp.html][効果的にバグを報告するには]]
CLOSED: [2021-09-25 Sat 12:31]
** DONE [[https://www.ranvis.com/articles/smart-questions.ja.html][賢い質問のしかた]]
CLOSED: [2021-09-18 Sat 18:43]
技術コミュニティでの賢い質問のやりかたについて書かかれている。
会社などでもまったく同じで、いい質問にはすぐにレスがついて解決される。
愚かな質問に対して回答するのはストレスなので、誰も対応したがらない。放置される。解決に時間がかかる。

#+begin_quote
悪びれずに言うならば、私達は質問をする前に、自分で考えたり下調べしたがらない人達に敵意を持っているのだ。そういう人達は時間を無駄にする ―― 彼らは一方的に質問を行い、そして他のより興味深い質問や答えるに足る人に対して費やせた時間を無駄にする。このような人を私達は「敗者（losers, ルーザー / タコ）」と呼ぶ（そして歴史的な経緯でたまに「lusers」と綴る）。
#+end_quote

#+begin_quote
1.投稿先のフォーラムのアーカイブを検索して答えを探してみる。

2.ウェブを検索して答えを探してみる。

3.マニュアルを読んで答えを探してみる。

4.FAQ（よくある質問）を読んで答えを探してみる。

5.追跡や実験を行って答えを見つけてみる。

6.詳しい友人に聞いてみる。

7.もしプログラマなら、ソースコードを読んで答えを探してみる。
#+end_quote
** [[https://speakerdeck.com/kawasy/managing-your-leader][リーダーとつきあうための冴えたやりかた / Managing Your Leader - Speaker Deck]]
上司とうまくやっていく方法。
** TODO [[https://www.slideshare.net/HubSpot/the-hubspot-culture-code-creating-a-company-we-love][Culture Code: Creating A Lovable Company]]
企業カルチャー。
** TODO [[https://datatracker.ietf.org/doc/html/rfc1855][rfc1855]]
ネチケットガイドライン。
** [[https://ben.balter.com/2014/11/06/rules-of-communicating-at-github/][15 rules for communicating at GitHub | Ben Balter]]
GitHubでのコミュニケーションのやりかた。
* Archives
** DONE [[https://gigazine.net/news/20181023-gnu-kind-communications-guidelines/][GNUプロジェクト提唱者のリチャード・ストールマンによる「心あるコミュニケーションのガイドライン」が発表される - GIGAZINE]]
CLOSED: [2021-10-03 Sun 14:37]
ガイドライン。名前で呼びかけて敬意を示すのはよさそうだな。
