20210926143523-communication.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>communication</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">communication</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org59782a4">概要</a></li>
<li><a href="#org6dc356a">Memo</a></li>
<li><a href="#org2e48a43">Tasks</a></li>
<li><a href="#org7a54df6">Reference</a>
<ul>
<li><a href="#orgb0d298a"><span class="done DONE">DONE</span> 効果的にバグを報告するには</a></li>
<li><a href="#org56ffe87"><span class="done DONE">DONE</span> 賢い質問のしかた</a></li>
<li><a href="#orgfd80056">リーダーとつきあうための冴えたやりかた / Managing Your Leader - Speaker Deck</a></li>
<li><a href="#org690690d"><span class="todo TODO">TODO</span> Culture Code: Creating A Lovable Company</a></li>
<li><a href="#org845c370"><span class="todo TODO">TODO</span> rfc1855</a></li>
<li><a href="#org623a0e7">15 rules for communicating at GitHub | Ben Balter</a></li>
</ul>
</li>
<li><a href="#org249c893">Archives</a>
<ul>
<li><a href="#org97b409c"><span class="done DONE">DONE</span> GNUプロジェクト提唱者のリチャード・ストールマンによる「心あるコミュニケーションのガイドライン」が発表される - GIGAZINE</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org59782a4" class="outline-2">
<h2 id="org59782a4"><a href="#org59782a4">概要</a></h2>
<div class="outline-text-2" id="text-org59782a4">
<p>
効果的なコミュニケーションのTipsをまとめる。
</p>
</div>
</div>
<div id="outline-container-org6dc356a" class="outline-2">
<h2 id="org6dc356a"><a href="#org6dc356a">Memo</a></h2>
</div>
<div id="outline-container-org2e48a43" class="outline-2">
<h2 id="org2e48a43"><a href="#org2e48a43">Tasks</a></h2>
</div>
<div id="outline-container-org7a54df6" class="outline-2">
<h2 id="org7a54df6"><a href="#org7a54df6">Reference</a></h2>
<div class="outline-text-2" id="text-org7a54df6">
</div>
<div id="outline-container-orgb0d298a" class="outline-3">
<h3 id="orgb0d298a"><a href="#orgb0d298a"><span class="done DONE">DONE</span> <a href="https://www.chiark.greenend.org.uk/~sgtatham/bugs-jp.html">効果的にバグを報告するには</a></a></h3>
<div class="outline-text-3" id="text-orgb0d298a">
</div>
</div>
<div id="outline-container-org56ffe87" class="outline-3">
<h3 id="org56ffe87"><a href="#org56ffe87"><span class="done DONE">DONE</span> <a href="https://www.ranvis.com/articles/smart-questions.ja.html">賢い質問のしかた</a></a></h3>
<div class="outline-text-3" id="text-org56ffe87">
<p>
技術コミュニティでの賢い質問のやりかたについて書かかれている。
会社などでもまったく同じで、いい質問にはすぐにレスがついて解決される。
愚かな質問に対して回答するのはストレスなので、誰も対応したがらない。放置される。解決に時間がかかる。
</p>

<blockquote>
<p>
悪びれずに言うならば、私達は質問をする前に、自分で考えたり下調べしたがらない人達に敵意を持っているのだ。そういう人達は時間を無駄にする ―― 彼らは一方的に質問を行い、そして他のより興味深い質問や答えるに足る人に対して費やせた時間を無駄にする。このような人を私達は「敗者（losers, ルーザー / タコ）」と呼ぶ（そして歴史的な経緯でたまに「lusers」と綴る）。
</p>
</blockquote>

<blockquote>
<p>
1.投稿先のフォーラムのアーカイブを検索して答えを探してみる。
</p>

<p>
2.ウェブを検索して答えを探してみる。
</p>

<p>
3.マニュアルを読んで答えを探してみる。
</p>

<p>
4.FAQ（よくある質問）を読んで答えを探してみる。
</p>

<p>
5.追跡や実験を行って答えを見つけてみる。
</p>

<p>
6.詳しい友人に聞いてみる。
</p>

<p>
7.もしプログラマなら、ソースコードを読んで答えを探してみる。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgfd80056" class="outline-3">
<h3 id="orgfd80056"><a href="#orgfd80056"><a href="https://speakerdeck.com/kawasy/managing-your-leader">リーダーとつきあうための冴えたやりかた / Managing Your Leader - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-orgfd80056">
<p>
上司とうまくやっていく方法。
</p>
</div>
</div>
<div id="outline-container-org690690d" class="outline-3">
<h3 id="org690690d"><a href="#org690690d"><span class="todo TODO">TODO</span> <a href="https://www.slideshare.net/HubSpot/the-hubspot-culture-code-creating-a-company-we-love">Culture Code: Creating A Lovable Company</a></a></h3>
<div class="outline-text-3" id="text-org690690d">
<p>
企業カルチャー。
</p>
</div>
</div>
<div id="outline-container-org845c370" class="outline-3">
<h3 id="org845c370"><a href="#org845c370"><span class="todo TODO">TODO</span> <a href="https://datatracker.ietf.org/doc/html/rfc1855">rfc1855</a></a></h3>
<div class="outline-text-3" id="text-org845c370">
<p>
ネチケットガイドライン。
</p>
</div>
</div>
<div id="outline-container-org623a0e7" class="outline-3">
<h3 id="org623a0e7"><a href="#org623a0e7"><a href="https://ben.balter.com/2014/11/06/rules-of-communicating-at-github/">15 rules for communicating at GitHub | Ben Balter</a></a></h3>
<div class="outline-text-3" id="text-org623a0e7">
<p>
GitHubでのコミュニケーションのやりかた。
</p>
</div>
</div>
</div>
<div id="outline-container-org249c893" class="outline-2">
<h2 id="org249c893"><a href="#org249c893">Archives</a></h2>
<div class="outline-text-2" id="text-org249c893">
</div>
<div id="outline-container-org97b409c" class="outline-3">
<h3 id="org97b409c"><a href="#org97b409c"><span class="done DONE">DONE</span> <a href="https://gigazine.net/news/20181023-gnu-kind-communications-guidelines/">GNUプロジェクト提唱者のリチャード・ストールマンによる「心あるコミュニケーションのガイドライン」が発表される - GIGAZINE</a></a></h3>
<div class="outline-text-3" id="text-org97b409c">
<p>
ガイドライン。名前で呼びかけて敬意を示すのはよさそうだな。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
